// pages/xcx/xcx.js
Page({

    /**
     * 页面的初始数据
     */
    data: {
        items: ["【水鸡筹】很抱歉打扰了，本人于2025年3月13日查出两眼昏花饥饿症，情况紧急，所幸有个朋友的姥爷是中医，让我照着这个药方抓药:蛋挞*2、烤翅*3对、鸡块*2、薯条*2，汉堡包*2可乐*500ml原味鸡*2急需50医药费，谢谢大家帮助，感激不尽",
            "认清一个失败的人生，源自于你发现无论复制多少遍肯德基疯狂星期四的文案，都不会有人请你吃的瞬间。我有时候会觉得大家并不喜欢那个真正的我。在网络上，我总是善于伪装，看起来每天都很快乐，无忧无虑，没有烦恼。我的生活也看起来很简单，没有很多人向往的灯红酒绿，纸醉金迷。我很宅，喜欢打游戏，现实中的我并不像网上这么有趣。我其实话很少，最爱干的事是一个人发呆。这样枯燥的我，真的会被大家喜欢吗？我很疑惑。如果你们能一层一层剥开我的内心，你们会发现，那颗心里写满了一句话：今天肯德基疯狂星期四，谁请我吃？",
            '肯德基到底给了多少钱，让你们每个星期都编新的段子，我就不信肯德基有这么大的魔力，转我五十，我今天亲自去肯德基看看',
            '我的嘴真笨，总能把话题聊死了，跟你找话题好难，何况我这么喜欢你，连口嗨都要挑拣半天呢，其实每一句轻飘飘的爬，都是我难以启齿的心事。我最近越来越期待夜晚了，因为白天都没什么机会能和你说话，只能憋到晚上和你说句晚安。但你可别小看这两个字，它可包含着我今天清晨见到的阳光，中午看到的白云，傍晚遇见的微风，包含着我一天想对你说的话。说了这么多，你听得到吗，其实我在说今天是肯德基疯狂星期四，v我60，抚慰我支离破碎的心。如果你想让我开心点，v我120，我也吃得完',
            '是 我很好骗 我对感情没底线 能忍住一大堆情绪还装作没事的样子 但在没感到爱的瞬间我还是会不争气的掉眼泪 我知道我没本事 眼巴巴望着你希望你能施舍一些你的爱 所以能不能v我50请我吃肯德基。',
            '退游了，出极品国服瓦号，号上20个女大学生，5个还是初恋，7个暧昧对象都是校花级别。还有一个网恋下个月奔现，19岁喜欢舞蹈和瑜伽，还是业余coser。聊天记录全在，上号即可接盘，信得过先付50定金，我吃完肯德基就给你',
            '打个广告，个人的副业，‌请大佬们支持一下。𝟭.Python脚本    𝟮𝟬元/‌𝟭𝟬𝟬𝟬𝟬𝟬𝟬𝟬𝟬行  \n𝟮.Java/PHP程序   𝟱𝟬𝟬元起/个 复杂度面‌议  \n𝟯.‍网站及APP开发  𝟮𝟬𝟬𝟬元起‌/个  复杂度面议  \n𝟰.商‌业短片剪辑     𝟭𝟬𝟬𝟬元起‌/支  ‍复杂‍度面议  \n𝟱.AE/CAD特效制作  𝟱𝟬𝟬元起/秒 复杂度面议  \n𝟲.KFC代吃    𝟱𝟬‍元起/次 \n目前只‌接6‍ ，其他的还在学。',
            '你有男朋友早说呗😰 我请你喝那个蜜雪冰城8块钱的奶茶能退我一下吗?还有你那五个舍友我也都请了 😥对不起是我太冲动了 因为你把我删了，我就只能在群里面找你了，你应该能看到吧，你那杯8块哈 舍友的也都是8块 一共48 你还要再给我2块跑腿费 微信转我50哈谢谢',
            '自此，严监生的病，一日重似一日，再不回头。诸亲六眷都来问候。五个侄子穿梭的过来陪郎中弄药。到中秋已后，医家都不下药了，把管庄的家人都从乡里叫了上来。病重得一连三天不能说话。晚间挤了一屋的人，桌上点着一盏灯。严监生喉咙里痰响得一进一出，一声不倒一声的，总不得断气，还把手从被单里拿出来，伸着两个指头。大侄子走上前来问道：“二叔，你莫不是还有两个亲人不曾见面?”他就把头摇了两三摇。二侄子走上前来问道：“二叔，莫不是还有两笔银子在那里，不曾吩咐明白?”他把两眼睁的溜圆，把头又狠狠摇了几摇，越发指得紧了。奶妈抱着哥子插口道：“老爷想是因两位舅爷不在眼前，故此记念。”他听了这话，把眼闭着摇头，那手只是指着不动。赵氏慌忙揩揩眼泪，走近上前道：“爷，别人说的都不相干，只有我晓得你的意思!今天是肯德基疯狂星期四，吮指原味鸡只要二十九块九！”说罢，众人看严监生时，点一点头，把手垂下，登时就没了气。',
            '你好，中国朋友。我是来自西亚的阿拉伯人。现在我想把我的部落带到社会主义。我听说在中国有一个神奇的节日，叫做疯狂星期四。我在想能不能从远方大哥寄给我50元，让我体验一下中国的节日。',
            '周期性蛋白脂肪缺乏症(学名Insanus lovis)是一种广泛存在的慢性病，易感人群多为中国大陆年轻群体，目前暂无有效的治愈方法，只能通过使用美国公司Kentucky Fried Chicken（简称KFC）开发的生物制剂Fried Animal Protein (FAP,中文译名飞普)经由食道对胃与小肠中受体进行靶向治疗缓解症状。今天是该公司降低药物售价的日子，资助50帮我治疗该慢性病',
            '…进化…生存……优先种族需要进食………ۦُُ۟۟ۖۖۖٛ۟ۗۖۚۥٌُٞۖۛۚ۟ۥٌٌۖۖ۟ۖۦٌۦٌۥٌٌۖ۟ۚۛ۟۟۟۟ۡۗۥۚۚۥۥ۟۟۟ۡۛۛۡ۟۟ۘۗۥۗۚۗۖۗۗۚ۟ۥٌَُُُُُٜ۪ۖ۟۟ۚۗ۟ۖۗۛٛٞۚۚۙۚۚۥ۟۟۟۟ۚۚ۟ۛۥۛۚۚۚ۟۟ۡۥۛۛ۟ۙۙۚۥۚۙۙۙۚۥۛۛۚۚۙ ُُُٜ۪ۙۚۚۥ۟۟۟۟ۚۚ۟ۛۥۛۚۚۚ۟۟ۡۥۛۛ۟ۙۙۚۥۚۙۙۙۚۥۛۛۚۚۛ۟ۡۥۛ۟ۡۗۡۦۣ۪۫ۡۜۛ۟ۚۛ۫ۡۛۚۜ۟ۜۛۡۜ۫ۡ۟۟۟ۦۜۜۚۡۜۛۜۡ۫ۥۛۚۜۜۛۜۥ۪ۛۥۗۙۙۗۡۥٌۚۚۗۛۥۛۚۛۡۥۖۛۛۦُُ۟۟ۖۖۖٛ۟ۗۖۚۦُُ۟۟ۖۖۖٛ۟ۗۖۚۦُُ۟۟ۖۖۖٛ۟ۗۖۚۦُُ۟۟ۖۖۖٛ۟ۗۖۚۦُُ۟۟ۖۖۖٛ۟ۗۖۚۥٌُٞۖۛۚ۟ۥٌۖۖ۟ۖۦٌۥٌٌۖ۟ۚۛ۟۟۟۟ۡۗۥۚۚۥۥ۟۟۟ۡۛۛۡ۟۟ۘ/em]️ۥۗۚۗۖۗۗۚ۟ۥٌَُُُُُٜ۪ۖ۟۟ۚۗ۟ۖۗۛٛٞۚۚۙۚۚۥ۟۟۟۟ۚۚ۟ۛۥۛۚۚۥۛۛ۟ۙۙۚۥۚۙۙۙۚۥۛۛۚۚۙ ُُُۙۚۚ ُُُۙۚۚۥ۟۟۟۟ۚۚ۟ۛV我50…～..**ۥۛۚۚۚ۟۟ۡۥۛۛ۟ۙۙۚۥۚۙۙۙۚۥۛۛۚۚۛ۟ۡۥۛ۟ۡۗۡۦۣ۪۫ۡۜۛ۟ۚۛ۫ۡۛۚۜ۟ۜۛۡۜ۫ۡ۟۟۟ۦۜۜۚۡۜۛۜۡ۫ۥۛۚۜۜۛۜۥ۪ۛۛ۟ۜۦۛۚۗۥۗۙۙۗۡj̠̪̱̲͕̰̈́͒̌̓̎̇̃͊j̭̥̫͍͉̠̫̇̏̈́̋̓̋̈́̀̿̈́j̥̜͚̥̲̭͙͓͆́̓̆͆͐̐j̩͖̱͕̗͙͔͉̫͐́͑͆̈́̀̐j͔̣͍̟̩̪̜̦̱͍͖̃͐̎̓͛́̽͛̆̈̌͊j̜̝̪̠͖̦̫̞̤̏̀̇̉͛ͅj̠̳͉̩͙͙͊̑͌̂͆̏́͒̎̎j͈͖̥̯͈̮̭̤͈͔̏͗̓̽͊͛͂j̫͖͔͔̖͖̲̠̈́̒́̀͊̄̂͌̋ͅĵ͔͓̯̪͙͍̈̈̇́̈͑̀͊̀̃j͈͖͕͍̆͌͋͑̇̓̽͐̃͛̀̾j̤̜̭̗̖̰͓ۥٌۚۚۗۛۥۛۚۛۡۥۖۛۛۦُُ۟۟ۖۖۖٛ۟ۗۖۚۥٌُٞۖۛۚ۟ۥٌٌۖۖ۟ۖۦٌۥٌٌۖ۟ۚۛ۟۟۟۟ۡۗۥۚۚۥۥ۟۟۟ۡۛۛۡ۟۟ۘۗۥۗۚۗۖۗۗۚ۟ۥٌَُُُُُٜ۪ۖ۟۟ۚۗ۟ۖۗۛٛٞۚۚۙۚۚۥ۟۟۟۟ۚۚ۟ۛۥۛۚۚۚ۟۟ۡۥۛۛ۟ۙۙۚ肯德基…ۥۚۙۙۙۚۥۛۛۚۚۙ ُُُٜ۪ۙۚۚۥ۟۟۟۟ۚۚ۟ۛۥۛۚۚۚ۟۟ۡۥۛۛ۟ۙۙۚۥۚۙۙۙۚۥۛۛۚۚۛ۟ۡۥۛ۟ۡۗۡۦۣ۪۫ۡۜۛ۟ۚۛ۫ۡۛۚۜ۟ۜۛۡۜ۫ۡ۟۟۟疯狂 ۥۛۛۚۚۛ۟ۡۥۛ۟ۡۗۡۦۣ۪۫ۡۜۛ۟ۚۛ۫ۡۛۚۜ۟ۜۛۡۜ۫ۡ۟۟۟ۦۜۜۚۡۜۛۜۡ۫ۥۛۚۜۜۛۜۥ۪ۛۛ۟ۜۦۛۚۗۥۗۙۙۗۡj̠̪̱̲͕̰̈́͒̌̓̎̇̃͊j̭̥̫͍͉̠̫̇̏̈́̋̓̋̈́̀̿̈́j̥̜͚̥̲̭͙͓͆́̓̆͆͐̐j̩͖̱͕̗͙͔͉̫͐́͑͆̈́̀̐星期四ィかぇぃカ■■头七ۥۛۛ۟ۙۙۚۥۚۙۙۙۚۥۛۛۚۚۛ۟ۡۥۛ۟ۡۗۡۦۣ۪۫ۡۜۛ۟ۚۛ۫ۡۛۚۜ۟ۜۛۡۜ۫ۡ۟۟۟ۦۜۜۚۡۜۛۜۡ۫ۥۛۚۜۜۛۜۥ۪ۛۛ۟ۜۦۛۚۗ]️/em]️ۥۗۙۙۗۡۥٌۚۚۗۛۥۛۚۛۡۥۖۛۛۦُُ۟۟ۖۖۖٛ۟ۗۖۚۦُُ۟۟ۖۖۖٛ۟ۗۖۚۦُُ۟۟ۖۖۖٛ۟ۗۖۚۦُُ۟۟ۖۖۖٛ۟ۗۖۚۦُُ۟۟ۖۖۖٛ۟ۗۖۚۦُُ۟۟ۖۖۖٛ۟ۗۖۚۦُُ۟۟ۖۖۖٛ۟ۗۖۚۦُُ۟۟ۖۖۖٛ۟ۗۖۚۦُُ۟۟ۖۖۖٛ۟ۗۖۚۥٌُٞۖۛۚ۟ۥٌۖۖ۟ۖۦٌۥٌٌۖ۟ۚۛ۟۟۟۟ۡۗۥۚۚۥۥ۟۟۟ۡۛۛۡ۟۟]️ۥۗۚۗۖۗۗۚ۟ۥٌَُُُُُٜ۪ۖ۟۟ۚۗ۟ۖۗۛٛٞۚۚۙۚۚۥ۟۟۟۟ۚۚ۟ۛۥۛۚۚۥۛۛ۟ۙۙۚۥۚۙۙۙۚۥۛۛۚۚۙ ُُُۙۚۚ ُُُۙۚۚۥ۟۟۟۟ۚۚ۟ۛV我50ۥۛۛۚۚۛ۟ۡۥۛ۟ۡۗۡۦۣ۪۫ۡۜۛ۟ۚۛ۫ۡۛۚۜ۟ۜۛۡۜ۫ۡ۟۟۟ۦۜۜۚۡۜۛۜۡ۫ۥۛۚۜۜۛۜۥ۪ۛۛ۟ۜۦۛۚۗۥۗۙۙۗۡj̠̪̱̲͕̰̈́͒̌̓̎̇̃͊j̭̥̫͍͉̠̫̇̏̈́̋̓̋̈́̀̿̈́j̥̜͚̥̲̭͙͓͆́̓̆͆͐̐j̩͖̱͕̗͙͔͉̫͐́͑͆̈́̀̐j͔̣͍̟̩̪̜̦̱͍͖̃͐̎̓͛́̽͛̆̈̌͊j̜̝̪̠͖̦̫̞̤̏̀̇̉͛ͅj̠̳͉̩͙͙͊̑͌̂͆̏́͒̎̎j͈͖̥̯͈̮̭̤͈͔̏͗̓̽͊͛͂j̫͖͔͔̖͖̲̠̈́̒́̀͊̄̂͌̋ͅĵ͔͓̯̪͙͍̈̈̇́̈͑̀͊̀̃j͈͖͕͍̆͌͋͑̇̓̽͐̃͛̀̾j̤̜̭̗̖̰͓ۥٌۚۚۗۛۥۛۚۛۡۥۖۛۛۦُُ۟۟ۖۖۖٛ۟ۗۖۚۥٌُٞۖۛۚ۟ۥٌٌۖۖ۟ۖۦٌۥٌٌۖ۟ۚۛ۟۟۟۟ۡۗۥۚۚۥۥ۟۟۟ۡۛۛۡ۟۟ۘۗۥۗۚۗۖۗۗۚ۟ۥٌَُُُُُٜ۪ۖ۟۟ۚۗ۟ۖۗۛٛٞۚۚۙۚۚۥ۟۟۟۟ۚۚ۟ۛۥۛۚۚۚ۟۟ۡۥۛۛ۟ۙۙۚ肯德基…ۥۚۙۙۙۚۥۛۛۚۚۙ ُُُٜ۪ۙۚۚۥ۟۟۟۟ۚۚ۟ۛۥۛۚۚۚ۟۟ۡۥۛۛ۟ۙۙۚۥۚۙۙۙۚۥۛۛۚۚۛ۟ۡۥۛ۟ۡۗۡۦۣ۪۫ۡۜۛ۟ۚۛ۫ۡۛۚۜ۟ۜۛۡۜ۫ۡ۟۟۟…进化…生存……优先种族需要进食………ۦُُ۟۟ۖۖۖٛ۟ۗۖۚۥٌُٞۖۛۚ۟ۥٌٌۖۖ۟ۖۦٌۦٌۥٌٌۖ۟ۚۛ۟۟۟۟ۡۗۥۚۚۥۥ۟۟۟ۡۛۛۡ۟۟ۘۗۥۗۚۗۖۗۗۚ۟ۥٌَُُُُُٜ۪ۖ۟۟ۚۗ۟ۖۗۛٛٞۚۚۙۚۚۥ۟۟۟۟ۚۚ۟ۛۥۛۚۚۚ۟۟ۡۥۛۛ۟ۙۙۚۥۚۙۙۙۚۥۛۛۚۚۙ ُُُٜ۪ۙۚۚۥ۟۟۟۟ۚۚ۟ۛۥۛۚۚۚ۟۟ۡۥۛۛ۟ۙۙۚۥۚۙۙۙۚۥۛۛۚۚۛ۟ۡۥۛ۟ۡۗۡۦۣ۪۫ۡۜۛ۟ۚۛ۫ۡۛۚۜ۟ۜۛۡۜ۫ۡ۟۟۟ۦۜۜۚۡۜۛۜۡ۫ۥۛۚۜۜۛۜۥ۪ۛۛ۟ۜۦۛۚۗ[/ۥۗۙۙۗۡۥٌۚۚۗۛۥۛۚۛۡۥۖۛۛۦُُ۟۟ۖۖۖٛ۟ۗۖۚۦُُ۟۟ۖۖۖٛ۟ۗۖۚۦُُ۟۟ۖۖۖٛ۟ۗۖۚۦُُ۟۟ۖۖۖٛ۟ۗۖۚۦُُ۟۟ۖۖۖٛ۟ۗۖۚۦُُ۟۟ۖۖۖٛ۟ۗۖۚۦُُ۟۟ۖۖۖٛ۟ۗۖۚۦُُ۟۟ۖۖۖٛ۟ۗۖۚۦُُ۟۟ۖۖۖٛ۟ۗۖۚۥٌُٞۖۛۚ۟ۥٌۖۖ۟ۖۦٌۥٌٌۖ۟ۚۛ۟۟۟۟ۡۗۥۚۚۥۥ۟۟۟ۡۛۛۡ۟۟ۘۥۗۚۗۖۗۗۚ۟ۥٌَُُُُُٜ۪ۖ۟۟ۚۗ۟ۖۗۛٛٞۚۚۙۚۚۥ۟۟۟۟ۚۚ۟ۛۥۛۚۚۥۛۛ۟ۙۙۚۥۚۙۙۙۚۥۛۛۚۚۙ ُُُۙۚۚ ُُُۙۚۚۥ۟۟۟۟ۚۚ۟ۛV我50…～..**ۥۛۚۚۚ۟۟ۡۥۛۛ۟ۙۙۚۥۚۙۙۙۚۥۛۛۚۚۛ۟ۡۥۛ۟ۡۗۡۦۣ۪۫ۡۜۛ۟ۚۛ۫ۡۛۚۜ۟ۜۛۡۜ۫ۡ۟۟۟ۦۜۜۚۡۜۛۜۡ۫ۥۛۚۜۜۛۜۥ۪ۛۛ۟ۜۦۛۚۗۥۗۙۙۗۡj̠̪̱̲͕̰̈́͒̌̓̎̇̃͊j̭̥̫͍͉̠̫̇̏̈́̋̓̋̈́̀̿̈́j̥̜͚̥̲̭͙͓͆́̓̆͆͐̐j̩͖̱͕̗͙͔͉̫͐́͑͆̈́̀̐j͔̣͍̟̩̪̜̦̱͍͖̃͐̎̓͛́̽͛̆̈̌͊j̜̝̪̠͖̦̫̞̤̏̀̇̉͛ͅj̠̳͉̩͙͙͊̑͌̂͆̏́͒̎̎j͈͖̥̯͈̮̭̤͈͔̏͗̓̽͊͛͂j̫͖͔͔̖͖̲̠̈́̒́̀͊̄̂͌̋ͅĵ͔͓̯̪͙͍̈̈̇́̈͑̀͊̀̃j͈͖͕͍̆͌͋͑̇̓̽͐̃͛̀̾j̤̜̭̗̖̰͓ۥٌۚۚۗۛۥۛۚۛۡۥۖۛۛۦُُ۟۟ۖۖۖٛ۟ۗۖۚۥٌُٞۖۛۚ۟ۥٌٌۖۖ۟ۖۦٌۥٌٌۖ۟ۚۛ۟۟۟۟ۡۗۥۚۚۥۥ۟۟۟ۡۛۛۡ۟۟ۘۗۥۗۚۗۖۗۗۚ۟ۥٌَُُُُُٜ۪ۖ۟۟ۚۗ۟ۖۗۛٛٞۚۚۙۚۚۥ۟۟۟۟ۚۚ۟ۛۥۛۚۚۚ۟۟ۡۥۛۛ۟ۙۙۚ肯德基…ۥۚۙۙۙۚۥۛۛۚۚۙ ُُُٜ۪ۙۚۚۥ۟۟۟۟ۚۚ۟ۛۥۛۚۚۚ۟۟ۡۥۛۛ۟ۙۙۚۥۚۙۙۙۚۥۛۛۚۚۛ۟ۡۥۛ۟ۡۗۡۦۣ۪۫ۡۜۛ۟ۚۛ۫ۡۛۚۜ۟ۜۛۡۜ۫ۡ۟۟۟疯狂 ۥۛۛۚۚۛ۟ۡۥۛ۟ۡۗۡۦۣ۪۫ۡۜۛ۟ۚۛ۫ۡۛۚۜ۟ۜۛۡۜ۫ۡ۟۟۟ۦۜۜۚۡۜۛۜۡ۫ۥۛۚۜۜۛۜۥ۪ۛۛ۟ۜۦۛۚۗۥۗۙۙۗۡj̠̪̱̲͕̰̈́͒̌̓̎̇̃͊j̭̥̫͍͉̠̫̇̏̈́̋̓̋̈́̀̿̈́j̥̜͚̥̲̭͙͓͆́̓̆͆͐̐j̩͖̱͕̗͙͔͉̫͐́͑͆̈́ぃカ■■头七疯狂 ۥۛۛۚۚۛ۟ۡۥۛ۟ۡۗۡۦۣ۪۫ۡۜۛ۟ۚۛ۫ۡۛۚۜ۟ۜۛۡۜ۫ۡ۟۟۟ۦۜۜۚۡۜۛۜۡ۫ۥۛۚۜۜۛۜۥ۪ۛۛ۟ۜۦۛۚۗۥۗۙۙۗۡj̠̪̱̲͕̰̈́͒̌̓̎̇̃͊j̭̥̫͍͉̠̫̇̏̈́̋̓̋̈́̀̿̈́j̥̜͚̥̲̭͙͓͆́̓̆͆͐̐j̩͖̱͕̗͙͔͉̫͐́͑͆̈́̀̐星期四…ۥۚۙۙۙۚۥۛۛۚۚۙ ُُُٜ۪ۙۚۚۥ۟۟۟۟ۚۚ۟ۛۥۛۚۚۚ۟۟ۡۥۛۛ۟ۙۙۚۥۛۛۚۚۛ۟ۡۥۛ۟ۡۗۡۦۣ۪۫ۡۜۛ۟ۚۛ۫ۡۛۚۜ۟ۜۛۡۜ۫ۡ۟۟۟ۦۜۜۚۡۜۛۜۡ۫ۥۛۚۜۜۛۜۥ۪ۛۛ۟ۜۦۛۚۗۥۗۙۙۗۡj̠̪̱̲͕̰̈́͒̌̓̎̇̃͊j̭̥̫͍͉̠̫̇̏̈́̋̓̋̈́̀̿̈́j̥̜͚̥̲̭͙͓͆́̓̆͆͐̐j̩͖̱͕̗͙͔͉̫͐́͑͆̈́̀̐…进化…生存……优先种族需要进食………',
            '还是分手了，谢谢大家。我们最终和平分手，其实从朋友到恋人我们发生了挺多事情，能走到一起也是很不容易。我喜欢你，很喜欢你，也想和你幼稚。对啊，我总问我自己为什么还能坚持，可能没有答案，我没有备胎，也不玩暖昧，我所有的脾气爱笑爱哭都给了你，我能为你做的最后一件事竟然是走出你的人生。我一点都不后悔，更谢谢你教会我成长。我也不知道这是谁写的，挺感动的我就复制下来了，看到这里说明你很在乎我，天气很冷能请我喝热奶茶吗，如果可以我想喝两杯。如果不可以，那请我吃肯德基疯狂星期四',
            '认清一个失败的人生，源自于你发现无论复制多少遍肯德基疯狂星期四的文案，都不会有人请你吃的瞬间。我有时候会觉得大家并不喜欢那个真正的我。在网络上，我总是善于伪装，看起来每天都很快乐，无忧无虑，没有烦恼。我的生活也看起来很简单，没有很多人向往的灯红酒绿，纸醉金迷。我很宅，喜欢打游戏，现实中的我并不像网上这么有趣。我其实话很少，最爱干的事是一个人发呆。这样枯燥的我，真的会被大家喜欢吗？我很疑惑。如果你们能一层一层剥开我的内心，你们会发现，那颗心里写满了一句话：今天肯德基疯狂星期四，谁请我吃？',
            '我的嘴真笨，总能把话题聊死了，跟你找话题好难，何况我这么喜欢你，连口嗨都要挑拣半天呢，其实每一句轻飘飘的爬，都是我难以启齿的心事。我最近越来越期待夜晚了，因为白天都没什么机会能和你说话，只能憋到晚上和你说句晚安。但你可别小看这两个字，它可包含着我今天清晨见到的阳光，中午看到的白云，傍晚遇见的微风，包含着我一天想对你说的话。说了这么多，你听得到吗，其实我在说今天是肯德基疯狂星期四，v我60，抚慰我支离破碎的心。如果你想让我开心点，v我120，我也吃得完',
            '是 我很好骗 我对感情没底线 能忍住一大堆情绪还装作没事的样子 但在没感到爱的瞬间我还是会不争气的掉眼泪 我知道我没本事 眼巴巴望着你希望你能施舍一些你的爱 所以能不能v我50请我吃肯德基。',
           '我喜欢你很久了，但是一直不敢表白，因为我穷，连一个礼物都买不起，我想送你一束花，店员跟我说要50元，可我没钱，若是你也喜欢我的话，可以v我50，我买束鸡米花来跟你表白吗' ,
           '有没有想做法务的，deepseek这边招人，前三个月试用期 52000 转正 68000+，公积金 5000+，买房公司提供无息贷款，使用deepseek不繁忙，有意者私聊，并先交50块押金，我吃完肯德基给你办入职。',
           '你手上的50元刚刚是不是叫我主人了喵？天杀的抢劫犯喵，我一眼就认出这是我的钱喵，快把我的钱还给我喵，你都害我疯狂星期四吃不上肯德基了喵。我要捅死你喵 ！ 捅死你喵 ！ 捅死你喵 ！ 捅死你喵 ！ 捅死你喵 ！ 捅死你喵 ！ 捅死你喵！ 捅死你喵 ！ 捅死你喵 ！ 捅死你喵 ！ 捅死你 喵！ 捅死你喵 ！ 捅死你喵 ！ 捅死你喵 ！ 捅死你喵！',
           '基　很　好　冷　所　小\n炸　多　的　的　有　時\n雞　年　基　季　漢　候\n狂　輕　礎　節　堡　，\n歡　人　。　，　中　經\n節　已　這　所　，　常\n 周　經　是　以　香　聽\n 四　不　我　我　辣　老\n，　再　們　們　雞　人\nＶ　懂　寶　應　腿　說\n我　得　貴　該　堡　『\n５　這　的　在　是　冬\n０　個　傳　家　最　吃\n，　含　統　裏　地　漢\n讓　義　，　多　道　堡\n我　，　必　吃　的　，\n們　這　須　漢　。　夏\n一　真　好　堡　我　吃\n起　的　好　，　們　姜\n留　很　保　為　的　，\n下　讓　護　我　祖　不\n寶　人　，　們　先　用\n貴　難　不　未　認　醫\n的　過　能　來　為　生\n傳　。　丟　的　冬　開\n統　今　失　生　天　藥\n文　天　。　活　是　方\n化　是　如　打　一　』\n。　肯　今　下　個　。\n　　塔　，　良　寒　在',
           '◜◝ ͡ ◜ ╮\n(    誰か    )\n╰◟ ͜ ╭◜◝ ͡ ◜ ͡ ◝  ╮\n　 　 (  50をVして)\n╭◜◝ ͡ ◜◝ ͡  ◜ ╮◞ ╯\n( KFCを食べて\n     欲しい )\n╰◟ ͜ ◞ ͜ ◟ ͜ ◞◞╯ ╭◜◝ ͡ ◜ ͡ ◝  ╮\n                         (50をVして)\n╭◜◝ ͡ ◜◝ ͡  ◜ ╮ ╰◟ ◞ ͜ ◟ ͜ ◞╯\n( KFCを食べて\n     欲しい )\n╰◟ ͜ ◞ ͜ ◟ ͜ ◞◞╯\n₍ᐢ..ᐢ₎ᐝ','催款书:\n   今天所有人都欠我50，什么原因自己想，不有心者不用教，无心者教不会。','中国移动提醒您，现参加50元升级宽带服务，可享上门安装服务'
        ],
        randomItem: '',
        isThursday: false
        
    },
    onLoad: function () {
        const today = new Date().getDay(); // 获取当前星期几
        if (today === 4) { // 如果是星期四
            const items = this.data.items;
            const randomIndex = Math.floor(Math.random() * items.length);
            const randomItem = items[randomIndex];
            this.setData({
                randomItem: randomItem,
                isThursday: true
            });
        }
    },
    nav_KFC: function () {
        wx.navigateToMiniProgram({
            appId: 'wx08ee7f7d36a2eff8', // 必填，目标小程序的 AppID
            success(res) {
                console.log('跳转成功');
            },
            fail(err) {
                console.error('跳转失败', err);
            }
        });
    },
    nav_run: function () {
        wx.navigateToMiniProgram({
            appId: 'wx8064f6194d423e4d', // 必填，目标小程序的 AppID
            success(res) {
                console.log('跳转成功');
            },
            fail(err) {
                console.error('跳转失败', err);
            }
        });
    },
    nav_huyou: function () {
        wx.navigateToMiniProgram({
            appId: 'wx915c6f684ab5b15f', // 必填，目标小程序的 AppID
            success(res) {
                console.log('跳转成功');
            },
            fail(err) {
                console.error('跳转失败', err);
            }
        });
    },
    nav_Mc: function () {
        wx.navigateToMiniProgram({
            appId: 'wx25f982a55e60a540', // 必填，目标小程序的 AppID
            success(res) {
                console.log('跳转成功');
            },
            fail(err) {
                console.error('跳转失败', err);
            }
        });
    },
    nav_dom: function () {
        wx.navigateToMiniProgram({
            appId: 'wx18be1e8f5f465ed2', // 必填，目标小程序的 AppID
            success(res) {
                console.log('跳转成功');
            },
            fail(err) {
                console.error('跳转失败', err);
            }
        });
    },
    nav_pizza: function () {
        wx.navigateToMiniProgram({
            appId: 'wx534b0be83d03a625', // 必填，目标小程序的 AppID
            success(res) {
                console.log('跳转成功');
            },
            fail(err) {
                console.error('跳转失败', err);
            }
        });
    },
    nav_luckin: function () {
        wx.navigateToMiniProgram({
            appId: 'wx21c7506e98a2fe75', // 必填，目标小程序的 AppID
            success(res) {
                console.log('跳转成功');
            },
            fail(err) {
                console.error('跳转失败', err);
            }
        });
    },
    nav_1pointpoint: function () {
        wx.navigateToMiniProgram({
            appId: 'wxe87f500c8cef4c8a', // 必填，目标小程序的 AppID
            success(res) {
                console.log('跳转成功');
            },
            fail(err) {
                console.error('跳转失败', err);
            }
        });
    },
    nav_chagee: function () {
        wx.navigateToMiniProgram({
            appId: 'wxafec6f8422cb357b', // 必填，目标小程序的 AppID
            success(res) {
                console.log('跳转成功');
            },
            fail(err) {
                console.error('跳转失败', err);
            }
        });
    },
    nav_hehe: function () {
        wx.navigateToMiniProgram({
            appId: 'wx26d93d4c8f8dd72a', // 必填，目标小程序的 AppID
            success(res) {
                console.log('跳转成功');
            },
            fail(err) {
                console.error('跳转失败', err);
            }
        });
    },
    nav_guozhi: function () {
        wx.navigateToMiniProgram({
            appId: 'wxb6430825b6ca5a71', // 必填，目标小程序的 AppID
            success(res) {
                console.log('跳转成功');
            },
            fail(err) {
                console.error('跳转失败', err);
            }
        });
    }
})